app/views/users/show.html.erb

SELECT "posts".* FROM "posts" INNER JOIN "likes" ON "posts"."id" = "likes"."post_id" WHERE "likes"."user_id" = ?  [["user_id", 8]]
SELECT COUNT(*) FROM "posts" INNER JOIN "likes" ON "posts"."id" = "likes"."post_id" WHERE "likes"."user_id" = ?  [["user_id", 8]]
SELECT COUNT(*) FROM "likes"
---

		<p>Total number of post: <%= @user.posts.count %></p>
		<p>Total number of likes: <%= @user.liked_posts.count %></p>