app/views/posts/show.html.erb

SELECT "likes".* FROM "likes"
---

	<% @post.likers.each do |liker| %>