app/controllers/posts_controller.rb

  def index
  	@user = User.find(session[:user_id])
  	@posts = Post.all
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
SELECT "posts".* FROM "posts"

  def show
  	@user = User.find(session[:user_id])
  	@post = Post.find_by_id!(params[:id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 23]]

  def add_post
  	post = Post.create(user_id: session[:user_id], message: params[:message])
---
INSERT INTO "posts" ("created_at", "message", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2015-12-20 06:26:18.869181"], ["message", "high"], ["updated_at", "2015-12-20 06:26:18.869181"], ["user_id", 3]]

  def delete
  	Post.destroy(params[:id])
---
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 16]]

  def like
  	@like = Like.create(user_id: session[:user_id], post_id: params[:id])
---
INSERT INTO "likes" ("created_at", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2015-12-20 07:43:47.241323"], ["post_id", 17], ["updated_at", "2015-12-20 07:43:47.241323"], ["user_id", 4]]