app/controllers/users_controller.rb

INSERT INTO "users" ("alias", "created_at", "email", "name", "password", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["alias", ""], ["created_at", "2015-12-20 05:06:19.689910"], ["email", ""], ["name", ""], ["password", ""], ["updated_at", "2015-12-20 05:06:19.689910"]]
---
  def register
  	user = User.create(name: params[:name], alias: params[:alias], email: params[:email], password:params[:password])

SELECT  "users".* FROM "users"  WHERE "users"."email" = 'test1@gmail.com' LIMIT 1
---
  def login
  	if User.find_by(email: params[:email]) and User.find_by(password: params[:password])!= nil
  		user = User.find_by(email: params[:email])